app/Controllers/Api/Catalogo.php

SELECT *
FROM `generos`
WHERE `generos`.`id` = '2'
---
    public function index()
    {
        $planId = session()->get('plan_id') ?? 1;
        $userId = session()->get('user_id'); // <--- IMPORTANTE
        $page   = $this->request->getVar('page') ?? 1;
        $generoId = $this->request->getVar('genero');

        $model = new ContenidoModel();
        $generoModel = new GeneroModel();

        // A. SI HAY GÉNERO -> Devolvemos estructura de "Landing de Género"
        if (!empty($generoId)) {
            $nombreGenero = $generoModel->find($generoId)['nombre'] ?? 'Contenido';

SELECT *
FROM `contenidos`
WHERE `tipo_id` = 1
ORDER BY RAND()
 LIMIT 5
---
    public function getPeliculasLanding()
    {
        $planId = session()->get('plan_id') ?? 1;
        $userId = session()->get('user_id'); // <--- IMPORTANTE

        $model = new ContenidoModel();

        // 1. CARRUSEL
        $carrusel = $model->where('tipo_id', 1)->orderBy('RAND()')->limit(5)->find();

SELECT `contenido_id`
FROM `mi_lista`
WHERE `usuario_id` = '3'
AND `contenido_id` IN ('2','21','23','20','3')
---
    private function marcarEnMiLista($contenidos, $userId) {
        if (empty($contenidos) || !$userId) return $contenidos;

        // Aseguramos cargar el modelo si no está
        $miListaModel = new \App\Models\MiListaModel();

        // Sacamos solo los IDs
        $ids = array_column($contenidos, 'id');

        if (empty($ids)) return $contenidos;

        // Preguntamos a la BD
        $favoritos = $miListaModel->where('usuario_id', $userId)
                                  ->whereIn('contenido_id', $ids)
                                  ->findColumn('contenido_id');