app/Controllers/Admin/Peliculas.php

    public function create() {
        $generoModel = new GeneroModel();
        return view('backend/peliculas/form', [
            'titulo' => 'Nuevo Contenido',
            'tipo_id' => $this->tipoId,
            'generos' => $generoModel->orderBy('nombre', 'ASC')->findAll()
---
SELECT *
FROM `generos`
ORDER BY `nombre` ASC