app/Controllers/Auth.php

public function index()
    {
        if (session()->get('is_logged_in')) {
            return redirect()->to('/');
        }

        $model = new UsuarioModel();

        // FILTRO: Solo usuarios con ID entre 2 y 4
        $data['usuarios'] = $model->where('id >=', 2)
                                  ->where('id <=', 4)
                                  ->orderBy('username', 'ASC')
                                  ->findAll();
---
SELECT *
FROM `usuarios`
WHERE `id` >= 2
AND `id` <= 4
ORDER BY `username` ASC

    public function login()
        {
            $id = $this->request->getPost('id');
            $password = $this->request->getPost('password');

            $model = new UsuarioModel();
            $user = $model->find($id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '3'