app/Controllers/Home.php

        }

        // DATOS COMUNES
        $listaGeneros = $generoModel->orderBy('nombre', 'ASC')->findAll();
---
SELECT *
FROM `generos`
ORDER BY `nombre` ASC

    private function procesarMetadatos(&$contenidos, $userId)
    {
        if (empty($contenidos))
            return;

        // 1. Instanciamos el modelo de Mi Lista
        // Asegúrate de tener: use App\Models\MiListaModel; arriba del todo
        $miListaModel = new \App\Models\MiListaModel();

        // 2. Obtenemos los IDs de los contenidos que vamos a procesar
        $ids = array_column($contenidos, 'id');

        // 3. Consultamos cuáles de estos IDs están en la lista del usuario
        $favoritos = [];
        if (!empty($ids) && $userId) {
            $favoritos = $miListaModel->where('usuario_id', $userId)
                ->whereIn('contenido_id', $ids)
                ->findColumn('contenido_id');
---
SELECT `contenido_id`
FROM `mi_lista`
WHERE `usuario_id` = '3'
AND `contenido_id` IN ('17','20','10','13','15','19','21','18','11','22')

    public function paginaPeliculas()
    {
        // 1. Datos básicos
        $userId = session()->get('user_id');

        // 2. Modelos
        $userModel = new \App\Models\UsuarioModel();
        $generoModel = new \App\Models\GeneroModel();

        // 3. Perfiles (Lógica corregida por IDs)
        $otrosPerfiles = $userModel->where('id >=', 2)
            ->where('id <=', 4)
            ->where('id !=', $userId)
            ->findAll();

        // 4. DATOS COMPLETOS (Para que no falle el Header)
        $data = [
            'titulo' => 'Películas - La Butaca',
            'generos' => $generoModel->findAll(),
            'otrosPerfiles' => $otrosPerfiles,

            // --- VARIABLES DE SEGURIDAD (Para evitar errores en la vista) ---
            'splash' => false,   // Evita error de variable indefinida en header
            'mostrarHero' => false,   // Evita error si el header busca esta variable
            'categoria' => 'Películas', // Evita error en títulos
            'carrusel' => [],      // Por si acaso footer o header lo piden
            'secciones' => []       // Por si acaso
        ];
---
SELECT *
FROM `usuarios`
WHERE `id` >= 2
AND `id` <= 4
AND `id` != '3'
SELECT *
FROM `generos`