app/Controllers/Home.php

 public function paginaPeliculas()
    {
        // 1. Datos básicos
        $userId = session()->get('user_id');

        // 2. Modelos
        $userModel = new \App\Models\UsuarioModel();
        $generoModel = new \App\Models\GeneroModel();

        // 3. Perfiles (Lógica corregida por IDs)
        $otrosPerfiles = $userModel->where('id >=', 2)
                                   ->where('id <=', 4)
                                   ->where('id !=', $userId)
                                   ->findAll();

        // 4. DATOS COMPLETOS (Para que no falle el Header)
        $data = [
            'titulo'        => 'Películas - La Butaca',
            'generos'       => $generoModel->findAll(),
---
SELECT *
FROM `usuarios`
WHERE `id` >= 2
AND `id` <= 4
AND `id` != '3'
SELECT *
FROM `generos`