app/Controllers/Perfil.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '3'
SELECT *
FROM `usuarios`
WHERE `id` != '3'
AND `id` >= 2
AND `id` <= 4
SELECT *
FROM `generos`
ORDER BY `nombre` ASC
---
    public function index()
    {
        if (!session()->get('is_logged_in')) return redirect()->to('/auth');

        $userId = session()->get('user_id');
        $planId = session()->get('plan_id');
        $userModel = new UsuarioModel();
        $generoModel = new GeneroModel();

        $usuario = $userModel->find($userId);
        $otrosPerfiles = $userModel->where('id !=', $userId)
                                   ->where('id >=', 2)
                                   ->where('id <=', 4)
                                   ->findAll();
        $listaGeneros = $generoModel->orderBy('nombre', 'ASC')->findAll();