app/Models/ContenidoModel.php

SELECT *
FROM `contenidos`
WHERE `tipo_id` = 1
---
    public function getPeliculas($planUsuario = 1) {
        if ($planUsuario == 2) {
            // Premium ve todo
            return $this->where('tipo_id', 1)->findAll();