app/Models/ContenidoModel.php

SELECT `contenidos`.*
FROM `contenidos`
ORDER BY `vistas` DESC
 LIMIT 10
---
    public function getTendencias($limit = 10, $planId = 1)
    {
        $builder = $this->select('contenidos.*')
            ->orderBy('vistas', 'DESC');

        $this->_aplicarFiltrosPlan($builder, $planId);

        return $builder->findAll($limit);

SELECT *
FROM `contenidos`
WHERE `tipo_id` = 2
ORDER BY RAND()
 LIMIT 10
---
    public function getContentRandom($tipoId, $limit = 10, $planId = 1)
    {
        $builder = $this->where('tipo_id', $tipoId);

        $this->_aplicarFiltrosPlan($builder, $planId);

        return $builder->orderBy('RAND()')->findAll($limit);