app/Models/ContenidoModel.php

    public function getTendencias($limit = 10, $planId = 1)
    {
        $builder = $this->select('contenidos.*')->orderBy('vistas', 'DESC');
        $this->_aplicarFiltrosPlan($builder, $planId);
        return $builder->findAll($limit);
---
SELECT `contenidos`.*
FROM `contenidos`
ORDER BY `vistas` DESC
 LIMIT 10

    public function getContentRandom($tipoId, $limit = 10, $planId = 1)
    {
        $builder = $this->where('tipo_id', $tipoId);
        $this->_aplicarFiltrosPlan($builder, $planId);
        return $builder->orderBy('RAND()')->findAll($limit);
---
SELECT *
FROM `contenidos`
WHERE `tipo_id` = 2
ORDER BY RAND()
 LIMIT 10

    public function getPorGenero($generoId, $tipoId, $limit = 10, $excluirIds = [], $planId = 1)
    {
        $builder = $this->select('contenidos.*')
            ->join('contenido_genero cg', 'contenidos.id = cg.contenido_id')
            ->where('cg.genero_id', $generoId)
            ->where('contenidos.tipo_id', $tipoId);

        $this->_aplicarFiltrosPlan($builder, $planId);

        if (!empty($excluirIds)) {
            $builder->whereNotIn('contenidos.id', $excluirIds);
        }

        return $builder->orderBy('contenidos.fecha_agregada', 'DESC')->findAll($limit);
---
SELECT `contenidos`.*
FROM `contenidos`
JOIN `contenido_genero` `cg` ON `contenidos`.`id` = `cg`.`contenido_id`
WHERE `cg`.`genero_id` = '2'
AND `contenidos`.`tipo_id` = 1
ORDER BY `contenidos`.`fecha_agregada` DESC
 LIMIT 10

    public function getContenidoPaginadas($planId, $limit, $offset, $generoNombre = null)
    {
        // 1. Seleccionamos contenidos de tipo Película (1)
        $builder = $this->select('contenidos.*')
                        ->where('contenidos.tipo_id', 1);

        // 2. Si viene un Género (Texto: "Terror", "Ciencia Ficcion")
        if (!empty($generoNombre)) {
            // Decodificamos por si viene con %20
            $nombreLimpio = urldecode($generoNombre);

            // Hacemos el doble JOIN para llegar al nombre:
            // Contenidos -> Pivot (contenido_genero) -> Generos
            $builder->join('contenido_genero cg', 'contenidos.id = cg.contenido_id')
                    ->join('generos g', 'cg.genero_id = g.id')
                    ->where('g.nombre', $nombreLimpio);
        }

        // 3. Aplicamos seguridad (Kids/Free)
        $this->_aplicarFiltrosPlan($builder, $planId);

        // 4. Orden y Paginación
        return $builder->orderBy('contenidos.fecha_agregada', 'DESC')
                       ->findAll($limit, $offset);
---
SELECT `contenidos`.*
FROM `contenidos`
JOIN `contenido_genero` `cg` ON `contenidos`.`id` = `cg`.`contenido_id`
WHERE `cg`.`genero_id` = 1
AND `contenidos`.`tipo_id` = 1
ORDER BY `contenidos`.`fecha_agregada` DESC
 LIMIT 10

    public function getDetallesCompletos($id)
    {
        $peli = $this->find($id);
        if (!$peli) return null;

        $db = \Config\Database::connect();

        // Géneros
        $builder = $db->table('contenido_genero');
        $builder->select('generos.nombre')
                ->join('generos', 'generos.id = contenido_genero.genero_id')
                ->where('contenido_id', $id);
        $peli['generos'] = $builder->get()->getResultArray();

        // Actores
        $builder = $db->table('contenido_actor');
        $builder->select('actores.nombre, actores.foto, contenido_actor.personaje')
                ->join('actores', 'actores.id = contenido_actor.actor_id')
                ->where('contenido_id', $id);
        $peli['actores'] = $builder->get()->getResultArray();
---
SELECT *
FROM `contenidos`
WHERE `contenidos`.`id` = '4'
SELECT `generos`.`nombre`
FROM `contenido_genero`
JOIN `generos` ON `generos`.`id` = `contenido_genero`.`genero_id`
WHERE `contenido_id` = '4'
SELECT `actores`.`nombre`, `actores`.`foto`, `contenido_actor`.`personaje`
FROM `contenido_actor`
JOIN `actores` ON `actores`.`id` = `contenido_actor`.`actor_id`
WHERE `contenido_id` = '4'