app/Models/UsuarioModel.php

    public function getListaIds($usuarioId)
{
    // Asumiendo que tu tabla se llama 'listas' o 'usuario_listas'
    // y tiene los campos 'usuario_id' y 'contenido_id'
    $db = \Config\Database::connect();
    $builder = $db->table('mi_lista'); // <--- CAMBIA 'listas' POR EL NOMBRE REAL DE TU TABLA
    $builder->select('contenido_id');
    $builder->where('usuario_id', $usuarioId);

    $query = $builder->get();
---
SELECT `contenido_id`
FROM `mi_lista`
WHERE `usuario_id` = '2'